{
  "semesters": [
    {
      "title": "Y1 Semester 1",
      "notes": [
        {
          "title": "CS1101S Programming Methodology",
          "grade": "A",
          "review": "<p>Could be considered one of the hardest introductory modules in NUS. There is a very heavy workload. 4h solely on lectures and 2h on tutorials. On top of that you still are required to do coding tasks, which could take up literally 1 whole day.</p><p>You would start off with the theory of recursion, and some basic programs that limit your answer to using solely recursion. This encourages you to think in a different way - a way where a programmer should think. This way of thinking would help you in your future career as a programmer/computer scientist.</p><p>All in all, CS1101S is definitely memorable for me, and it’s definitely much better than other CS1010 modules in terms of the concepts we learnt.</p>",
          "link": "https://github.com/onepersonhere/notes/tree/main/Sem%201/CS1101S",
          "rating": 4
        },
        {
          "title": "CS1231S Discrete Structures",
          "review": "<p>Could be considered the hardest module in semester 1, this module requires knowledge from H3 Mathematics, for the topics on logic. If you do not have such knowledge, then it will be very hard to chase for top grades. Furthermore, the <code>S</code> version meant that all students taking the mod is from CS, and the bell curve would be disadvantages to those who do not have strong fundamentals in mathematical logic.</p><p>The topics covered are the following:</p><ul><li>Logic and proof techniques propositions, conditionals, quantifications.</li><li>Relations and Functions Equivalence relations and partitions. Partially ordered sets. Well-Ordering Principle.</li><li>Function equality. Boolean/identity/inverse functions. Bijection.</li><li>Mathematical formulation of data models (linear model, trees, graphs).</li><li>Counting and Combinatoric Pigeonhole Principle. Inclusion-Exclusion Principle.</li><li>Number of relations on a set, number of injections from one finite set to another, Diagonalization proof An infinite countable set has an uncountable power set.</li><li>Algorithmic proof An infinite set has a countably infinite subset. Subsets of countable sets are countable.</li></ul>",
          "link": "https://github.com/onepersonhere/notes/tree/main/Sem%201/CS1231S",
          "rating": 2
        },
        {
          "title": "IS1103 Ethics in Computing",
          "review": "<p>One of the worse module in NUS. (Thankfully they reorganized this mod into IS1108)</p><p>This was taken during covid semester, the entire module was conducted in 10 quizzes (10 weeks) and each quiz has 10 questions - that's 100 questions for 100% of the grade! The questions were supposedly based on the provided textbook (which you need to buy/pirate). It was well known that there are many people who cheated in this mod, where they will form large groups to discuss and distribute the quiz answers.</p>",
          "rating": 1
        },
        {
          "title": "MA1521 Calculus in Computing",
          "review": "<p>This module covers fundamental data structures and algorithms, including arrays, linked lists, stacks, queues, trees, and graphs.</p><p>The workload is heavy with weekly assignments and quizzes. Understanding the time and space complexity of algorithms is crucial for doing well.</p><p>CS2040S has provided me with a strong foundation in data structures and algorithms, which is essential for any software engineer.</p>",
          "link": "https://github.com/onepersonhere/notes/tree/main/Sem%201/MA1521",
          "rating": 4
        },
        {
          "title": "RVX1002 What do you mean? Meaning & Communication in Intercultural contexts",
          "grade": "A",
          "review": "<p>This was one of the better mods I have taken in semester 1. The module was conducted in a small class of around 16 people, however since it was covid semester, some of my classmates are connected to the class through Zoom, whereas the rest of us are at the physical classroom.</p><p>I didn't have any idea what it was about, until I started learning from the mod. I felt that the prof was very engaging despite the lack of interaction from my classmates. It was definitely an interesting topic to learn. This module was very much about linguistics and how to simplify people's communication.</p>",
          "rating": 5
        }
      ],
      "color": "rgba(var(--bs-info-rgb))"
    },
    {
      "title": "Y1 Semester 2",
      "notes": [
        {
          "title": "CS2030S Programming Methodology II",
          "grade": "A-",
          "review": "<p>This module was interesting during my time. We have multiple labs in which we are to write a code that fits the description of the assignment. The code was to be in the style of OOP.</p><p>There were 2 practical exams, a midterm and a final exam. Unfortunately, the server was down during the second practical exam and we had to rush as they reduced the exam time by half.</p><p>All in all, it is still a doable module as it is a more advanced version of CS1101S.</p>",
          "link": "https://github.com/onepersonhere/notes/tree/main/Sem%202/CS2030S",
          "rating": 4
        },
        {
          "title": "CS2040S Data Structures and Algorithms",
          "grade": "A",
          "review": "<p>This module was incredibly difficult and with the time I spent studying on this module, it could be said that it was not worth it. This was largely because the module teaches you about the theory behind common algorithms and data structures, while they test on how you manipulate them.</p><p>Hence, you need to master not just the theory, but also the practical aspect of applying the algorithms and data structures. One good way of practicing this aspect is to grind leetcode/hackerrank.</p>",
          "link": "https://github.com/onepersonhere/notes/tree/main/Sem%202/CS2040S",
          "rating": 2
        },
        {
          "title": "GEA1000 Quantitative Reasoning with Data",
          "review": "<p>This module has a horrible bell-curve. Everyone is expected to get full marks and there are multiple students who cheated in a group. I personally know some of these students (although I did not cheat) and I believe it is very common in NUS.</p><p>The module content was relatively simple and many topics were already covered in CS1231S (under probability). However, there were group projects and in-class quizzes which make it very hard to maintain your position in the bell-curve.</p>",
          "link": "https://github.com/onepersonhere/notes/tree/main/Sem%202/GEA1000",
          "rating": 1
        },
        {
          "title": "MA2001 Linear Algebra I",
          "review": "<p>Content was relatively easy to understand at first, but much harder as you progress. I was having trouble keeping up with the lessons due to the amount of time I dedicate to CS2040S. However, luckily the final exam was relatively easy as most of the questions were calculation rather than theory. This means that even with my terrible (25th percentile) mid-terms, I was still able to maintain my position in the bell-curve.</p>",
          "link": "https://github.com/onepersonhere/notes/tree/main/Sem%202/MA2001",
          "rating": 4
        },
        {
          "title": "RVSS1002 Feeding the belly of a nation",
          "review": "<p>This module was relatively interesting as it is considered \"chill\". This means that I put in very little effort to the module.</p><p>The module was mainly about Singapore's food culture, i.e. Hawker food, farms, government policies on food. Most of the assignments were group work (except for the individual essay and reflection).</p><p>* Take note that both the module coordinator and the lecturer has been changed and the syllabus is no longer the same.</p>",
          "rating": 3
        }
      ],
      "color": "#aa82f2"
    },
    {
      "title": "Y1 Summer",
      "notes": [
        {
          "title": "CP2106 Independent Software Development Project (Orbital)",
          "grade": "CS (Artemis)",
          "review": "<p>NUS Orbital 2022 was very fun and engaging.</p><p>Both my friend and I teamed up to build a game from scratch; at first, we had troubles with choosing the correct game engine, however, we decided on the Godot engine as we believe it's the easiest engine to learn in the short span of 3 months (compared to Unity or Unreal) and we would spend more time building the game rather than learning the engine.</p><p>Thankfully, our Artemis level has been maintained throughout the 3 milestones. This was largely due to the fact that I had put in a lot of effort on the documentation of the game itself.</p>",
          "rating": 5,
          "link": "https://docs.google.com/document/d/1wQjGsiPLWeSY_6v22aFV54N9r4aaHnMU-TmhsJElN44/edit#",
          "expanded": true
        }
      ],
      "color": "#82f2a8"
    },
    {
      "title": "Y2 Semester 1",
      "notes": [
        {
          "title": "CS2103T Software Engineering",
          "review": "<p>I would say this module is pretty easy. I misjudged the difficulty when I started the mod, especially with the IP (Individual Project), in which I put in many of my hours unnecessarily. However, after we proceeded to TP (Team Project), I laid back more as we equally divided the workload to each member.</p><p>This may be due to our very experienced leader who led the team to success, who coincidentally is my friend. Our team was relatively strong and hardworking in the programming component, and was pretty cohesive as well.</p><p>Our team project is featured on the front page of this website: Minefriends.</p>",
          "grade": "A-",
          "rating": 4,
          "link": "https://github.com/onepersonhere/notes/tree/main/Sem%203/CS2103T"
        },
        {
          "title": "CS2101 Effective Communication for Computing Professionals",
          "review": "<p>This module was twinned with CS2103T. It is compulsory to take this together with the CS2103T.</p><p>My class was taught by the module coordinator who is very experienced in this topic. I would feel that we had one of the better teachers as she would make our class exciting and engaging. I feel that I had learned a lot from this course.</p><p>However, the grading for the course is largely dependent on the bell curve. People like my friends who had much experience in presentations had honed their presentations well and were able to achieve better grades than people like me whose only experience is PW in JC. That being said, I am actually very shocked at the difference in the quality of presentations from the students in the class.</p>",
          "rating": 3
        },
        {
          "title": "CS2100 Computer Organisation",
          "review": "<p>This module was okay at first, however, there were a lot of hiccups along the way as there was a new professor.</p><p>All in all, I would say the final paper was what destroyed my grade for this module. The final paper only had 37 points for 50% of the score? And I wasn't able to answer the first portion as it was basically an IQ test for coming up with the solution to the question. In the heat of the moment, I was too anxious to think about the problem properly as I did not expect the difference in the setting of the paper.</p><p>(Also, what's up with the missing equation in the first question? ...)</p>",
          "rating": 2,
          "link": "https://github.com/onepersonhere/notes/tree/main/Sem%203/CS2100"
        },
        {
          "title": "CS2105 Introduction to Computer Networks",
          "review": "<p>All in all a very good module. I was able to learn the fundamental knowledge of Computer Networks easily as the lectures and exams were not too difficult. Although you need to make sure that you do not make any careless mistakes in the exam like me (which could have cost me my A+).</p><p>Anyways, the module was organized into 4 lab assignments, 1 25% midterm, and 1 50% final. The score is 1:1 for each point obtained in the exam and lab.</p>",
          "grade": "A",
          "rating": 5,
          "link": "https://github.com/onepersonhere/notes/tree/main/Sem%203/CS2105"
        },
        {
          "title": "RVN1001 The Great Extinction: rewilding and conservation",
          "review": "<p>This module is no longer offered after my semester. This is because all GEN modules are now 2k in level and no longer CS/CU.</p><p>Anyway, the module coordinator who taught the class was very strict in terms of teaching style. And the scores obtained were biased to the likability of the student. On top of that, there was also a lot of heavy physical work (trekking in the jungle during a heavy downpour?!). Therefore, I do not recommend this module.</p>",
          "grade": "CS",
          "rating": 1
        }
      ],
      "color": "#ef7a7a"
    },
    {
      "title": "Y2 Semester 2",
      "notes": [
        {
          "title": "CP3880 Advanced Technology Attachment Programme (ATAP)",
          "review": "<p>For this semester, I did my 6 months long internship attachment at Binance. It was pretty easy as Binance is a fully remote role and I have no problem with keeping up with my studies</p>",
          "grade": "CS",
          "rating": 5,
          "link": "downloads/ATAP Final Report.pdf"
        },
        {
          "title": "CS2109S Introduction To AI and Machine Learning",
          "review": "<p>First module with Ben Leong as the lecturer, pretty interesting as I was able to absorb most of the lecture's material.</p>",
          "grade": "A",
          "rating": 5
        },
        {
          "title": "ST2334 Probability and Statistics",
          "review": "<p>Statistics is not my strong suit, and the bell curve being so steep means that getting As are difficult (also I didn't study hard for finals)</p>",
          "rating": 3
        }
      ],
      "color": "#c78ee6"
    },
    {
      "title": "Y2 Summer",
      "notes": [
        {
          "title": "CP3880 Advanced Technology Attachment Programme (ATAP)",
          "review": "<p>For this semester, I did my 6 months long internship attachment at Binance. It was pretty easy as Binance is a fully remote role and I have no problem with keeping up with my studies</p>",
          "grade": "CS",
          "rating": 5,
          "link": "downloads/ATAP Final Report.pdf"
        },
        {
          "title": "RVC2000 Culture and Sustainability in Southeast Asia ",
          "review": "<p>All in all a pretty fun mod. As the first (and last) overseas RVRC mod I have participated, this mod takes us to Sabah and Sarawak. We are able to interact with the indigenous population and experience some local cultures. There's also a university visit to UMS as well as a office visit to Shell. As a student, all of us are in-charge of some roles, for me, I was the designated photographer.</p>",
          "grade": "A-",
          "rating": 5
        }
      ],
      "color": "#9ce6ce"
    },
    {
      "title": "Y3 Semester 1 - Summer Exchange to University of Oslo",
      "notes": [
        {
          "title": "IN3130 Algorithms: Design and Efficiency",
          "review": "<p>This module test a combination of both CS3230 and CS3231. It talks in depth about the theory of computation and several advanced algorithms. The exam is in oral presentation format and is 100% of the grade.</p>",
          "grade": "CS",
          "rating": 4
        },
        {
          "title": "IN4080 Natural Language Processing",
          "review": "<p>I can't review this mod much because I never actually went for the lecture (it is in conflict with IN3130)</p>",
          "grade": "CS",
          "rating": 3
        },
        {
          "title": "STK-MAT3700 Introduction to Mathematical Finance and Investment Theory",
          "review": "<p>The professor is very professional in terms of content delivery, I actually understood most of the lecture's content and was able to apply them easily to the tutorials. The exam was written format, however it is very similar to the tutorial questions.</p>",
          "grade": "CS (A)",
          "rating": 5
        }
      ],
      "color": "#faf9ca"
    },
    {
      "title": "Y3 Semester 2",
      "notes": [
        {
          "title": "CS2106 Introduction to OS",
          "review": "<p>Interesting prelude to parallel computing, I like the labs but the tutorials are useless. I would've skipped the tutorial if not for attendance.</p>",
          "rating": 3
        },
        {
          "title": "CS4222 Wireless Networking",
          "review": "<p>Another group project based module, hit or miss.</p>",
          "rating": 3
        },
        {
          "title": "QF1100 Introduction to QF",
          "review": "<p>Meh</p>",
          "grade": "S",
          "rating": 2
        },
        {
          "title": "QF2103 Computing for QF",
          "review": "<p>I think this module has high bell-curve, plus they expect us to write out the code on a piece of paper. This is highly unusual for a computing based mod, I think they should have practical exam rather than written paper exam.</p>",
          "rating": 3
        },
        {
          "title": "QF3103 Advanced Mathematics in QF",
          "review": "<p>Talks about similar things I have learned overseas, although some of the mathematical notations are different, but the knowledge is easily transferable</p>",
          "grade": "A-",
          "rating": 4
        }
      ],
      "color": "#faf9ca"
    },
    {
      "title": "Y3 Summer",
      "notes": [
        {
          "title": "DMX1XXX Design Your Own Course (DYOC)",
          "review": "<p>Free 3 MCs, did DYOC for database</p>",
          "grade": "CS",
          "rating": 5
        },
        {
          "title": "DMX1501AI AISG Level 2: Foundations in AI ",
          "review": "<p>Free 5 MCs, basically same content as CS2109S</p>",
          "grade": "CS",
          "rating": 5
        }
      ],
      "color": "#faf9ca"
    },
    {
      "title": "Y4 Semester 1",
      "notes": [
        {
          "title": "CFG1003/1004 Financial Wellbeing",
          "review": "<p>Free 2MCs</p>",
          "grade": "CS",
          "rating": 5
        },
        {
          "title": "CS3103 Computer Networks Practice",
          "review": "<p>I love the TA, he is very reliable in helping us in the lab. It is a lab-based module, but there is still a final exam that will determine the final grade.</p>",
          "grade": "A-",
          "rating": 5
        },
        {
          "title": "CS4243 Computer Vision And Pattern Recognition",
          "review": "<p>Thanks to my group members, we are able to complete the group project in time. Our group got 23.5/25 for the group project which is in the upper quartile. For the project, apparently the prof only want us to present the poster and nothing else.</p>",
          "grade": "A",
          "rating": 5
        },
        {
          "title": "ES2660 Communicating in the Information Age",
          "review": "<p>The tutor was very nice in giving us tips and tricks for the mod, however I am a year 4 so I already am going to SU this :(</p>",
          "grade": "S",
          "rating": 3
        },
        {
          "title": "FSC2101 Forensic Science",
          "review": "<p>Took this to fulfil requirements and SU</p>",
          "grade": "S",
          "rating": 3
        },
        {
          "title": "MA2311 Techniques in Advanced Calculus",
          "review": "<p>The content may seem easy, as is very similar to A level mathematics, but the final exam is extremely luck-based. (I wasn't able to solve at least 50% of the paper)</p>",
          "rating": 3
        }
      ],
      "color": "#a96ded"
    }
  ]
}